_/Chapter_10/PartD/AirAlliance_SA/test/TestReservation/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nor="http://northair.airalliance.org/">
  <soapenv:Body>
    <nor:processItinerary>
      <!--Optional:-->
      <firstName>Abel</firstName>
      <!--Optional:-->
      <lastName>Osbert</lastName>
      <!--Optional:-->
      <source>BLR</source>
      <!--Optional:-->
      <destination>MAS</destination>
      <!--Optional:-->
      <travelDate>2009-04-07</travelDate>
      <!--Optional:-->
      <seatPreference>Win</seatPreference>
      <!--Optional:-->
      <foodPreference>Veg</foodPreference>
      <!--Optional:-->
      <guestID>g760</guestID>
      <seqID>23</seqID>
    </nor:processItinerary>
  </soapenv:Body>
</soapenv:Envelope>